{
    "category_descriptions": {
        "BB Cream": "Achieve a natural, flawless finish with our lightweight BB creams, perfect for everyday wear.",
        "Blush": "Add a healthy flush of color to your cheeks with our buildable and blendable blushes.",
        "Bronzer": "Get a sun-kissed glow all year round with our range of matte and shimmering bronzers.",
        "CC Cream": "Correct and perfect your complexion with our CC creams, designed to even out skin tone.",
        "Cleanser": "Wash away the day with our gentle cleansers, formulated to remove dirt and makeup without stripping your skin.",
        "Concealer": "Cover imperfections and brighten your under-eyes with our high-coverage concealers.",
        "Contour": "Define and sculpt your features with our easy-to-use contour products.",
        "Exfoliator": "Slough away dead skin cells and reveal a brighter complexion with our effective exfoliators.",
        "Eye Shadow": "Create endless eye looks with our pigmented and long-lasting eye shadows.",
        "Eyeliner": "Define your eyes with precision using our collection of liquid, gel, and pencil eyeliners.",
        "Face Mask": "Rejuvenate and pamper your skin with our wide selection of face masks for all skin types.",
        "Face Oil": "Nourish and hydrate your skin with our luxurious and fast-absorbing face oils.",
        "Foundation": "Find your perfect match with our diverse range of foundations, available in various shades and finishes.",
        "Highlighter": "Illuminate your best features with our stunning highlighters for a radiant glow.",
        "Lip Gloss": "Add shine and a touch of color to your lips with our non-sticky lip glosses.",
        "Lip Liner": "Define and shape your lips for a fuller look with our creamy lip liners.",
        "Lipstick": "Make a statement with our vibrant and comfortable lipsticks, available in matte, satin, and sheer finishes.",
        "Makeup Remover": "Gently and effectively remove all traces of makeup with our powerful makeup removers.",
        "Mascara": "Get longer, fuller lashes with our volumizing and lengthening mascaras.",
        "Moisturizer": "Hydrate, protect, and soothe your skin with our collection of daily moisturizers.",
        "Powder": "Set your makeup and control shine with our finely-milled setting powders.",
        "Primer": "Create a smooth canvas for your makeup and extend its wear with our range of primers.",
        "Serum": "Target your specific skin concerns with our potent and effective serums.",
        "Setting Spray": "Lock in your look for all-day wear with our refreshing setting sprays."
    }
}
